// Azkar ki list ko alag file mein define karna

List<String> getMorningAzkar() {
  return [
    "اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ وَ جَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللّهُ لا إِلٰهَ إِلَّا أَنتَ.",
    "اللّهُـمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَ رَحْمَتِكَ.",
    "اللّهُـمَّ بَارِكْ لِي فِي رَجُلِي وَ فِي قَلْبِي.",
    "اللّهُـمَّ إِنِّي أَسْأَلُكَ لَا تَرُدَّنِي خَائِبًا.",
    "اللّهُـمَّ إِنِّي أَصْبَحْتُ أُؤْمِنُ بِكَ وَ رَسُولِكَ.",
    "اللّهُـمَّ رَبِّ زِدْنِي عِلْمًا وَ فَهْمًا.",
    "اللّهُـمَّ جَعَلْنِي مِنَ الشَّاكرِينَ.",
    "اللّهُـمَّ اجْعَلْنِي فِي فَضْلِكَ وَ رَحْمَتِكَ.",
    "اللّهُـمَّ أَعِزَّنِي وَ أَيِّدْنِي بِالْفَارِقِ.",
    "اللّهُـمَّ اجْعَلْنِي مِنْ أَهْلِ الْجَنَّةِ."
  ];
}

List<String> getNightAzkar() {
  return [
    "اللّهُـمَّ بِسْمِكَ أَمُوتُ وَ أَحْيَا.",
    "اللّهُـمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ.",
    "اللّهُـمَّ اجْعَلْنِي مِنَ الصَّابِرِينَ.",
    "اللّهُـمَّ اَحْيِنَا عَلَىٰ أَحْسَنِ الْعَمَلِ.",
    "اللّهُـمَّ اجْعَلْنِي مِنْ أَهْلِ الجَنَّةِ.",
    "اللّهُـمَّ غَفِرْ لِي وَ لِعَائِلَتِي.",
    "اللّهُـمَّ أَحْسِنْ خُلُقِي وَ زَيِّنْنِي بِالْإِيمَانِ.",
    "اللّهُـمَّ تَقَبَّلْ صَدَقَاتِنَا وَ دُعَاءَنَا.",
    "اللّهُـمَّ اجْعَلْنَا مِنْ رُؤَسَاءِ أَهْلِ الْجَنَّةِ.",
    "اللّهُـمَّ آمِينَ بِرَحْمَتِكَ."
  ];
}

List<String> getEveningAzkar() {
  return [
    "اللّهُـمَّ إِنِّي أَسْأَلُكَ غَفْرَانَك.",
    "اللّهُـمَّ إِنِّي أَحْتَسِبُ عَمَلِي فِي سَبِيلِكَ.",
    "اللّهُـمَّ بَارِكْ فِي أَوْقَاتِنَا وَ عَمَلِنَا.",
    "اللّهُـمَّ رَبِّ تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ.",
    "اللّهُـمَّ اجْعَلْنَا مِنْ الَّذِينَ يَحْتَسُونَ شَفَاعَتَ النَّبِيِّ.",
    "اللّهُـمَّ أَغْنِنَا عَنْ قُوَّتِك وَ فَضْلِكَ.",
    "اللّهُـمَّ إِنِّي أَسْأَلُكَ جَنَّةً عَالِيَةً.",
    "اللّهُـمَّ اجْعَلْنَا مِنْ الَّذِينَ يَقُولُونَ رَبَّنَا لَا تَزِغْ قُلُوبَنَا.",
    "اللّهُـمَّ رَحْمَتُكَ وَ غَفْرَانُكَ.",
    "اللّهُـمَّ آمِينَ."
  ];
}
